import logging

logger = logging.getLogger(__name__)

# Общая подпись для приветственного сообщения
common_caption = """
<b>Добро пожаловать в MatrixVPN 🛡️</b> — ваш надежный инструмент для обеспечения <b>свободы</b> и <b>приватности</b> в интернете 🌐

🔵   <b><i>Примешь синюю таблетку</i></b> — и <b>сказке конец</b>.
Ты проснешься в своей постели и поверишь, что это был <i>сон</i>.

🔴   <b><i>Примешь красную таблетку</i></b> — войдешь в <b>страну чудес</b>.

Я покажу тебе, глубока ли кроличья нора. 🐇
"""

# Подпись, отображаемая после запроса
after_caption = """
<i> ⟳ Ожидайте перехода</i> в <b>реальный мир</b>.

<b>Обратного пути больше нет...</b> 🐇

ⓘ Запрос уже отправлен, ожидайте ответ ⌛
"""
